{
    "missing_paths_property": "[Missing Paths Property] Manifest entries of this build type require a 'paths' property."
    , "invalid_path_fragment": "[Invalid Path Fragment] The path fragment value must be a string that follows the path-fragment notation."
    , "invalid_root": "[Invalid Root] The path's root is invalid; the path must be absolute."
    , "invalid_path_list": "[Invalid Path List] The path list must be an array of iPathInfo."
    , "invalid_repos_propery": "[Invalid Repos Property] The 'repos' property must be an array of {iRepoMeta} instances."
    , "invalid_repo_meta": "[Invalid Repo Meta] The repo meta object must conform to the {iRepoMeta} interface."
    , "invalid_repo_type": "[Invalid Repo Type] The repo type does not exist in the repository list."
    , "file_path_load": "[File Path Load] Failed to load 1 or more file paths."
    , "duplicate_namespace": "[Duplicate Namespace] One or more namespaces has been used more than once."
    , "invalid_build_path": "[Invalid Build Path] The value did not match the build path pattern."
    , "invalid_paths_property": "[Invalid Files Property] The files property should be an array."
    , "invalid_dependency_annotation": "[Invalid Dependency Annotation] The factory dependency annotations must use dependency notation."
    , "EACCES": "(Permission denied): An attempt was made to access a file in a way forbidden by its file access permissions."
    , "EEXIST": "(File exists): An existing file was the target of an operation that required that the target not exist."
    , "EISDIR": "(Is a directory): An operation expected a file, but the given pathname was a directory."
    , "EMFILE": "(Too many open files in system): Maximum number of file descriptors allowable on the system has been reached, and requests for another descriptor cannot be fulfilled until at least one has been closed."
    , "ENOENT": "(No such file or directory): No entity (file or directory) could be found by the given path."
    , "ENOTDIR": "(Not a directory): A component of the given pathname existed, but was not a directory as expected."
    , "EPERM": "(Operation not permitted): An attempt was made to perform an operation that requires elevated privileges."
}